apache/nuttx/arch/arm/src/nrf52/hardware/nrf52_egu.h
/****************************************************************************
 * arch/arm/src/nrf52/hardware/nrf52_egu.h
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

#ifndef _ARCH_ARM_SRC_NRF52_HARDWARE_NRF52_EGU_H
#define _ARCH_ARM_SRC_NRF52_HARDWARE_NRF52_EGU_H

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>
#include "hardware/nrf52_memorymap.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Register offsets *********************************************************/

#define NRF52_EGU_INTEN_OFFSET               0x000300  /* Enable or disable interrupt */
#define NRF52_EGU_INTENSET_OFFSET            0x000304  /* Enable interrupt */
#define NRF52_EGU_INTENCLR_OFFSET            0x000308  /* Disable interrupt */
#define NRF52_EGU_TASKS_TRIGGER0_OFFSET      0x000000  /* Description collection[0]:  Trigger 0 for triggering the corresponding TRIGGERED[0] event */
#define NRF52_EGU_TASKS_TRIGGER1_OFFSET      0x000004  /* Description collection[0]:  Trigger 0 for triggering the corresponding TRIGGERED[0] event */
#define NRF52_EGU_TASKS_TRIGGER2_OFFSET      0x000008  /* Description collection[0]:  Trigger 0 for triggering the corresponding TRIGGERED[0] event */
#define NRF52_EGU_TASKS_TRIGGER3_OFFSET      0x00000c  /* Description collection[0]:  Trigger 0 for triggering the corresponding TRIGGERED[0] event */
#define NRF52_EGU_TASKS_TRIGGER4_OFFSET      0x000010  /* Description collection[0]:  Trigger 0 for triggering the corresponding TRIGGERED[0] event */
#define NRF52_EGU_TASKS_TRIGGER5_OFFSET      0x000014  /* Description collection[0]:  Trigger 0 for triggering the corresponding TRIGGERED[0] event */
#define NRF52_EGU_TASKS_TRIGGER6_OFFSET      0x000018  /* Description collection[0]:  Trigger 0 for triggering the corresponding TRIGGERED[0] event */
#define NRF52_EGU_TASKS_TRIGGER7_OFFSET      0x00001c  /* Description collection[0]:  Trigger 0 for triggering the corresponding TRIGGERED[0] event */
#define NRF52_EGU_TASKS_TRIGGER8_OFFSET      0x000020  /* Description collection[0]:  Trigger 0 for triggering the corresponding TRIGGERED[0] event */
#define NRF52_EGU_TASKS_TRIGGER9_OFFSET      0x000024  /* Description collection[0]:  Trigger 0 for triggering the corresponding TRIGGERED[0] event */
#define NRF52_EGU_TASKS_TRIGGER10_OFFSET     0x000028  /* Description collection[0]:  Trigger 0 for triggering the corresponding TRIGGERED[0] event */
#define NRF52_EGU_TASKS_TRIGGER11_OFFSET     0x00002c  /* Description collection[0]:  Trigger 0 for triggering the corresponding TRIGGERED[0] event */
#define NRF52_EGU_TASKS_TRIGGER12_OFFSET     0x000030  /* Description collection[0]:  Trigger 0 for triggering the corresponding TRIGGERED[0] event */
#define NRF52_EGU_TASKS_TRIGGER13_OFFSET     0x000034  /* Description collection[0]:  Trigger 0 for triggering the corresponding TRIGGERED[0] event */
#define NRF52_EGU_TASKS_TRIGGER14_OFFSET     0x000038  /* Description collection[0]:  Trigger 0 for triggering the corresponding TRIGGERED[0] event */
#define NRF52_EGU_TASKS_TRIGGER15_OFFSET     0x00003c  /* Description collection[0]:  Trigger 0 for triggering the corresponding TRIGGERED[0] event */
#define NRF52_EGU_EVENTS_TRIGGERED0_OFFSET   0x000100  /* Description collection[0]:  Event number 0 generated by triggering the corresponding TRIGGER[0] task */
#define NRF52_EGU_EVENTS_TRIGGERED1_OFFSET   0x000104  /* Description collection[0]:  Event number 0 generated by triggering the corresponding TRIGGER[0] task */
#define NRF52_EGU_EVENTS_TRIGGERED2_OFFSET   0x000108  /* Description collection[0]:  Event number 0 generated by triggering the corresponding TRIGGER[0] task */
#define NRF52_EGU_EVENTS_TRIGGERED3_OFFSET   0x00010c  /* Description collection[0]:  Event number 0 generated by triggering the corresponding TRIGGER[0] task */
#define NRF52_EGU_EVENTS_TRIGGERED4_OFFSET   0x000110  /* Description collection[0]:  Event number 0 generated by triggering the corresponding TRIGGER[0] task */
#define NRF52_EGU_EVENTS_TRIGGERED5_OFFSET   0x000114  /* Description collection[0]:  Event number 0 generated by triggering the corresponding TRIGGER[0] task */
#define NRF52_EGU_EVENTS_TRIGGERED6_OFFSET   0x000118  /* Description collection[0]:  Event number 0 generated by triggering the corresponding TRIGGER[0] task */
#define NRF52_EGU_EVENTS_TRIGGERED7_OFFSET   0x00011c  /* Description collection[0]:  Event number 0 generated by triggering the corresponding TRIGGER[0] task */
#define NRF52_EGU_EVENTS_TRIGGERED8_OFFSET   0x000120  /* Description collection[0]:  Event number 0 generated by triggering the corresponding TRIGGER[0] task */
#define NRF52_EGU_EVENTS_TRIGGERED9_OFFSET   0x000124  /* Description collection[0]:  Event number 0 generated by triggering the corresponding TRIGGER[0] task */
#define NRF52_EGU_EVENTS_TRIGGERED10_OFFSET  0x000128  /* Description collection[0]:  Event number 0 generated by triggering the corresponding TRIGGER[0] task */
#define NRF52_EGU_EVENTS_TRIGGERED11_OFFSET  0x00012c  /* Description collection[0]:  Event number 0 generated by triggering the corresponding TRIGGER[0] task */
#define NRF52_EGU_EVENTS_TRIGGERED12_OFFSET  0x000130  /* Description collection[0]:  Event number 0 generated by triggering the corresponding TRIGGER[0] task */
#define NRF52_EGU_EVENTS_TRIGGERED13_OFFSET  0x000134  /* Description collection[0]:  Event number 0 generated by triggering the corresponding TRIGGER[0] task */
#define NRF52_EGU_EVENTS_TRIGGERED14_OFFSET  0x000138  /* Description collection[0]:  Event number 0 generated by triggering the corresponding TRIGGER[0] task */
#define NRF52_EGU_EVENTS_TRIGGERED15_OFFSET  0x00013c  /* Description collection[0]:  Event number 0 generated by triggering the corresponding TRIGGER[0] task */

/* Register definitions *****************************************************/

