apache/nuttx/arch/arm/src/nrf52/hardware/nrf52_egu.h
#define NRF52_EGU4_INTEN               (NRF52_EGU4_BASE + NRF52_EGU_INTEN_OFFSET)
#define NRF52_EGU4_INTENSET            (NRF52_EGU4_BASE + NRF52_EGU_INTENSET_OFFSET)
#define NRF52_EGU4_INTENCLR            (NRF52_EGU4_BASE + NRF52_EGU_INTENCLR_OFFSET)
#define NRF52_EGU4_TASKS_TRIGGER0      (NRF52_EGU4_BASE + NRF52_EGU_TASKS_TRIGGER0_OFFSET)
#define NRF52_EGU4_TASKS_TRIGGER1      (NRF52_EGU4_BASE + NRF52_EGU_TASKS_TRIGGER1_OFFSET)
#define NRF52_EGU4_TASKS_TRIGGER2      (NRF52_EGU4_BASE + NRF52_EGU_TASKS_TRIGGER2_OFFSET)
#define NRF52_EGU4_TASKS_TRIGGER3      (NRF52_EGU4_BASE + NRF52_EGU_TASKS_TRIGGER3_OFFSET)
#define NRF52_EGU4_TASKS_TRIGGER4      (NRF52_EGU4_BASE + NRF52_EGU_TASKS_TRIGGER4_OFFSET)
#define NRF52_EGU4_TASKS_TRIGGER5      (NRF52_EGU4_BASE + NRF52_EGU_TASKS_TRIGGER5_OFFSET)
#define NRF52_EGU4_TASKS_TRIGGER6      (NRF52_EGU4_BASE + NRF52_EGU_TASKS_TRIGGER6_OFFSET)
#define NRF52_EGU4_TASKS_TRIGGER7      (NRF52_EGU4_BASE + NRF52_EGU_TASKS_TRIGGER7_OFFSET)
#define NRF52_EGU4_TASKS_TRIGGER8      (NRF52_EGU4_BASE + NRF52_EGU_TASKS_TRIGGER8_OFFSET)
#define NRF52_EGU4_TASKS_TRIGGER9      (NRF52_EGU4_BASE + NRF52_EGU_TASKS_TRIGGER9_OFFSET)
#define NRF52_EGU4_TASKS_TRIGGER10     (NRF52_EGU4_BASE + NRF52_EGU_TASKS_TRIGGER10_OFFSET)
#define NRF52_EGU4_TASKS_TRIGGER11     (NRF52_EGU4_BASE + NRF52_EGU_TASKS_TRIGGER11_OFFSET)
#define NRF52_EGU4_TASKS_TRIGGER12     (NRF52_EGU4_BASE + NRF52_EGU_TASKS_TRIGGER12_OFFSET)
#define NRF52_EGU4_TASKS_TRIGGER13     (NRF52_EGU4_BASE + NRF52_EGU_TASKS_TRIGGER13_OFFSET)
#define NRF52_EGU4_TASKS_TRIGGER14     (NRF52_EGU4_BASE + NRF52_EGU_TASKS_TRIGGER14_OFFSET)
#define NRF52_EGU4_TASKS_TRIGGER15     (NRF52_EGU4_BASE + NRF52_EGU_TASKS_TRIGGER15_OFFSET)
#define NRF52_EGU4_EVENTS_TRIGGERED0   (NRF52_EGU4_BASE + NRF52_EGU_EVENTS_TRIGGERED0_OFFSET)
#define NRF52_EGU4_EVENTS_TRIGGERED1   (NRF52_EGU4_BASE + NRF52_EGU_EVENTS_TRIGGERED1_OFFSET)
#define NRF52_EGU4_EVENTS_TRIGGERED2   (NRF52_EGU4_BASE + NRF52_EGU_EVENTS_TRIGGERED2_OFFSET)
#define NRF52_EGU4_EVENTS_TRIGGERED3   (NRF52_EGU4_BASE + NRF52_EGU_EVENTS_TRIGGERED3_OFFSET)
#define NRF52_EGU4_EVENTS_TRIGGERED4   (NRF52_EGU4_BASE + NRF52_EGU_EVENTS_TRIGGERED4_OFFSET)
#define NRF52_EGU4_EVENTS_TRIGGERED5   (NRF52_EGU4_BASE + NRF52_EGU_EVENTS_TRIGGERED5_OFFSET)
#define NRF52_EGU4_EVENTS_TRIGGERED6   (NRF52_EGU4_BASE + NRF52_EGU_EVENTS_TRIGGERED6_OFFSET)
#define NRF52_EGU4_EVENTS_TRIGGERED7   (NRF52_EGU4_BASE + NRF52_EGU_EVENTS_TRIGGERED7_OFFSET)
#define NRF52_EGU4_EVENTS_TRIGGERED8   (NRF52_EGU4_BASE + NRF52_EGU_EVENTS_TRIGGERED8_OFFSET)
#define NRF52_EGU4_EVENTS_TRIGGERED9   (NRF52_EGU4_BASE + NRF52_EGU_EVENTS_TRIGGERED9_OFFSET)
#define NRF52_EGU4_EVENTS_TRIGGERED10  (NRF52_EGU4_BASE + NRF52_EGU_EVENTS_TRIGGERED10_OFFSET)
#define NRF52_EGU4_EVENTS_TRIGGERED11  (NRF52_EGU4_BASE + NRF52_EGU_EVENTS_TRIGGERED11_OFFSET)
#define NRF52_EGU4_EVENTS_TRIGGERED12  (NRF52_EGU4_BASE + NRF52_EGU_EVENTS_TRIGGERED12_OFFSET)
#define NRF52_EGU4_EVENTS_TRIGGERED13  (NRF52_EGU4_BASE + NRF52_EGU_EVENTS_TRIGGERED13_OFFSET)
#define NRF52_EGU4_EVENTS_TRIGGERED14  (NRF52_EGU4_BASE + NRF52_EGU_EVENTS_TRIGGERED14_OFFSET)
#define NRF52_EGU4_EVENTS_TRIGGERED15  (NRF52_EGU4_BASE + NRF52_EGU_EVENTS_TRIGGERED15_OFFSET)
#define NRF52_EGU4_TASKS_TRIGGER0      (NRF52_EGU4_BASE + NRF52_EGU_TASKS_TRIGGER0_OFFSET)
#define NRF52_EGU4_TASKS_TRIGGER1      (NRF52_EGU4_BASE + NRF52_EGU_TASKS_TRIGGER1_OFFSET)
#define NRF52_EGU4_TASKS_TRIGGER2      (NRF52_EGU4_BASE + NRF52_EGU_TASKS_TRIGGER2_OFFSET)
#define NRF52_EGU4_TASKS_TRIGGER3      (NRF52_EGU4_BASE + NRF52_EGU_TASKS_TRIGGER3_OFFSET)
#define NRF52_EGU4_TASKS_TRIGGER4      (NRF52_EGU4_BASE + NRF52_EGU_TASKS_TRIGGER4_OFFSET)
#define NRF52_EGU4_TASKS_TRIGGER5      (NRF52_EGU4_BASE + NRF52_EGU_TASKS_TRIGGER5_OFFSET)
#define NRF52_EGU4_TASKS_TRIGGER6      (NRF52_EGU4_BASE + NRF52_EGU_TASKS_TRIGGER6_OFFSET)
#define NRF52_EGU4_TASKS_TRIGGER7      (NRF52_EGU4_BASE + NRF52_EGU_TASKS_TRIGGER7_OFFSET)
#define NRF52_EGU4_TASKS_TRIGGER8      (NRF52_EGU4_BASE + NRF52_EGU_TASKS_TRIGGER8_OFFSET)
#define NRF52_EGU4_TASKS_TRIGGER9      (NRF52_EGU4_BASE + NRF52_EGU_TASKS_TRIGGER9_OFFSET)
#define NRF52_EGU4_TASKS_TRIGGER10     (NRF52_EGU4_BASE + NRF52_EGU_TASKS_TRIGGER10_OFFSET)
#define NRF52_EGU4_TASKS_TRIGGER11     (NRF52_EGU4_BASE + NRF52_EGU_TASKS_TRIGGER11_OFFSET)
#define NRF52_EGU4_TASKS_TRIGGER12     (NRF52_EGU4_BASE + NRF52_EGU_TASKS_TRIGGER12_OFFSET)
#define NRF52_EGU4_TASKS_TRIGGER13     (NRF52_EGU4_BASE + NRF52_EGU_TASKS_TRIGGER13_OFFSET)
#define NRF52_EGU4_TASKS_TRIGGER14     (NRF52_EGU4_BASE + NRF52_EGU_TASKS_TRIGGER14_OFFSET)
#define NRF52_EGU4_TASKS_TRIGGER15     (NRF52_EGU4_BASE + NRF52_EGU_TASKS_TRIGGER15_OFFSET)
#define NRF52_EGU4_EVENTS_TRIGGERED0   (NRF52_EGU4_BASE + NRF52_EGU_EVENTS_TRIGGERED0_OFFSET)
#define NRF52_EGU4_EVENTS_TRIGGERED1   (NRF52_EGU4_BASE + NRF52_EGU_EVENTS_TRIGGERED1_OFFSET)
#define NRF52_EGU4_EVENTS_TRIGGERED2   (NRF52_EGU4_BASE + NRF52_EGU_EVENTS_TRIGGERED2_OFFSET)
#define NRF52_EGU4_EVENTS_TRIGGERED3   (NRF52_EGU4_BASE + NRF52_EGU_EVENTS_TRIGGERED3_OFFSET)
#define NRF52_EGU4_EVENTS_TRIGGERED4   (NRF52_EGU4_BASE + NRF52_EGU_EVENTS_TRIGGERED4_OFFSET)
#define NRF52_EGU4_EVENTS_TRIGGERED5   (NRF52_EGU4_BASE + NRF52_EGU_EVENTS_TRIGGERED5_OFFSET)
#define NRF52_EGU4_EVENTS_TRIGGERED6   (NRF52_EGU4_BASE + NRF52_EGU_EVENTS_TRIGGERED6_OFFSET)
#define NRF52_EGU4_EVENTS_TRIGGERED7   (NRF52_EGU4_BASE + NRF52_EGU_EVENTS_TRIGGERED7_OFFSET)
#define NRF52_EGU4_EVENTS_TRIGGERED8   (NRF52_EGU4_BASE + NRF52_EGU_EVENTS_TRIGGERED8_OFFSET)
#define NRF52_EGU4_EVENTS_TRIGGERED9   (NRF52_EGU4_BASE + NRF52_EGU_EVENTS_TRIGGERED9_OFFSET)
#define NRF52_EGU4_EVENTS_TRIGGERED10  (NRF52_EGU4_BASE + NRF52_EGU_EVENTS_TRIGGERED10_OFFSET)
#define NRF52_EGU4_EVENTS_TRIGGERED11  (NRF52_EGU4_BASE + NRF52_EGU_EVENTS_TRIGGERED11_OFFSET)
#define NRF52_EGU4_EVENTS_TRIGGERED12  (NRF52_EGU4_BASE + NRF52_EGU_EVENTS_TRIGGERED12_OFFSET)
#define NRF52_EGU4_EVENTS_TRIGGERED13  (NRF52_EGU4_BASE + NRF52_EGU_EVENTS_TRIGGERED13_OFFSET)
#define NRF52_EGU4_EVENTS_TRIGGERED14  (NRF52_EGU4_BASE + NRF52_EGU_EVENTS_TRIGGERED14_OFFSET)
#define NRF52_EGU4_EVENTS_TRIGGERED15  (NRF52_EGU4_BASE + NRF52_EGU_EVENTS_TRIGGERED15_OFFSET)

#define NRF52_EGU5_INTEN               (NRF52_EGU5_BASE + NRF52_EGU_INTEN_OFFSET)
#define NRF52_EGU5_INTENSET            (NRF52_EGU5_BASE + NRF52_EGU_INTENSET_OFFSET)
#define NRF52_EGU5_INTENCLR            (NRF52_EGU5_BASE + NRF52_EGU_INTENCLR_OFFSET)
#define NRF52_EGU5_TASKS_TRIGGER0      (NRF52_EGU5_BASE + NRF52_EGU_TASKS_TRIGGER0_OFFSET)
#define NRF52_EGU5_TASKS_TRIGGER1      (NRF52_EGU5_BASE + NRF52_EGU_TASKS_TRIGGER1_OFFSET)
#define NRF52_EGU5_TASKS_TRIGGER2      (NRF52_EGU5_BASE + NRF52_EGU_TASKS_TRIGGER2_OFFSET)
#define NRF52_EGU5_TASKS_TRIGGER3      (NRF52_EGU5_BASE + NRF52_EGU_TASKS_TRIGGER3_OFFSET)
#define NRF52_EGU5_TASKS_TRIGGER4      (NRF52_EGU5_BASE + NRF52_EGU_TASKS_TRIGGER4_OFFSET)
#define NRF52_EGU5_TASKS_TRIGGER5      (NRF52_EGU5_BASE + NRF52_EGU_TASKS_TRIGGER5_OFFSET)
#define NRF52_EGU5_TASKS_TRIGGER6      (NRF52_EGU5_BASE + NRF52_EGU_TASKS_TRIGGER6_OFFSET)
#define NRF52_EGU5_TASKS_TRIGGER7      (NRF52_EGU5_BASE + NRF52_EGU_TASKS_TRIGGER7_OFFSET)
#define NRF52_EGU5_TASKS_TRIGGER8      (NRF52_EGU5_BASE + NRF52_EGU_TASKS_TRIGGER8_OFFSET)
#define NRF52_EGU5_TASKS_TRIGGER9      (NRF52_EGU5_BASE + NRF52_EGU_TASKS_TRIGGER9_OFFSET)
#define NRF52_EGU5_TASKS_TRIGGER10     (NRF52_EGU5_BASE + NRF52_EGU_TASKS_TRIGGER10_OFFSET)
#define NRF52_EGU5_TASKS_TRIGGER11     (NRF52_EGU5_BASE + NRF52_EGU_TASKS_TRIGGER11_OFFSET)
#define NRF52_EGU5_TASKS_TRIGGER12     (NRF52_EGU5_BASE + NRF52_EGU_TASKS_TRIGGER12_OFFSET)
#define NRF52_EGU5_TASKS_TRIGGER13     (NRF52_EGU5_BASE + NRF52_EGU_TASKS_TRIGGER13_OFFSET)
#define NRF52_EGU5_TASKS_TRIGGER14     (NRF52_EGU5_BASE + NRF52_EGU_TASKS_TRIGGER14_OFFSET)
#define NRF52_EGU5_TASKS_TRIGGER15     (NRF52_EGU5_BASE + NRF52_EGU_TASKS_TRIGGER15_OFFSET)
#define NRF52_EGU5_EVENTS_TRIGGERED0   (NRF52_EGU5_BASE + NRF52_EGU_EVENTS_TRIGGERED0_OFFSET)
#define NRF52_EGU5_EVENTS_TRIGGERED1   (NRF52_EGU5_BASE + NRF52_EGU_EVENTS_TRIGGERED1_OFFSET)
#define NRF52_EGU5_EVENTS_TRIGGERED2   (NRF52_EGU5_BASE + NRF52_EGU_EVENTS_TRIGGERED2_OFFSET)
#define NRF52_EGU5_EVENTS_TRIGGERED3   (NRF52_EGU5_BASE + NRF52_EGU_EVENTS_TRIGGERED3_OFFSET)
#define NRF52_EGU5_EVENTS_TRIGGERED4   (NRF52_EGU5_BASE + NRF52_EGU_EVENTS_TRIGGERED4_OFFSET)
#define NRF52_EGU5_EVENTS_TRIGGERED5   (NRF52_EGU5_BASE + NRF52_EGU_EVENTS_TRIGGERED5_OFFSET)
#define NRF52_EGU5_EVENTS_TRIGGERED6   (NRF52_EGU5_BASE + NRF52_EGU_EVENTS_TRIGGERED6_OFFSET)
#define NRF52_EGU5_EVENTS_TRIGGERED7   (NRF52_EGU5_BASE + NRF52_EGU_EVENTS_TRIGGERED7_OFFSET)
#define NRF52_EGU5_EVENTS_TRIGGERED8   (NRF52_EGU5_BASE + NRF52_EGU_EVENTS_TRIGGERED8_OFFSET)
#define NRF52_EGU5_EVENTS_TRIGGERED9   (NRF52_EGU5_BASE + NRF52_EGU_EVENTS_TRIGGERED9_OFFSET)
#define NRF52_EGU5_EVENTS_TRIGGERED10  (NRF52_EGU5_BASE + NRF52_EGU_EVENTS_TRIGGERED10_OFFSET)
#define NRF52_EGU5_EVENTS_TRIGGERED11  (NRF52_EGU5_BASE + NRF52_EGU_EVENTS_TRIGGERED11_OFFSET)
#define NRF52_EGU5_EVENTS_TRIGGERED12  (NRF52_EGU5_BASE + NRF52_EGU_EVENTS_TRIGGERED12_OFFSET)
#define NRF52_EGU5_EVENTS_TRIGGERED13  (NRF52_EGU5_BASE + NRF52_EGU_EVENTS_TRIGGERED13_OFFSET)
#define NRF52_EGU5_EVENTS_TRIGGERED14  (NRF52_EGU5_BASE + NRF52_EGU_EVENTS_TRIGGERED14_OFFSET)
#define NRF52_EGU5_EVENTS_TRIGGERED15  (NRF52_EGU5_BASE + NRF52_EGU_EVENTS_TRIGGERED15_OFFSET)
#define NRF52_EGU5_TASKS_TRIGGER0      (NRF52_EGU5_BASE + NRF52_EGU_TASKS_TRIGGER0_OFFSET)
#define NRF52_EGU5_TASKS_TRIGGER1      (NRF52_EGU5_BASE + NRF52_EGU_TASKS_TRIGGER1_OFFSET)
#define NRF52_EGU5_TASKS_TRIGGER2      (NRF52_EGU5_BASE + NRF52_EGU_TASKS_TRIGGER2_OFFSET)
#define NRF52_EGU5_TASKS_TRIGGER3      (NRF52_EGU5_BASE + NRF52_EGU_TASKS_TRIGGER3_OFFSET)
#define NRF52_EGU5_TASKS_TRIGGER4      (NRF52_EGU5_BASE + NRF52_EGU_TASKS_TRIGGER4_OFFSET)
#define NRF52_EGU5_TASKS_TRIGGER5      (NRF52_EGU5_BASE + NRF52_EGU_TASKS_TRIGGER5_OFFSET)
#define NRF52_EGU5_TASKS_TRIGGER6      (NRF52_EGU5_BASE + NRF52_EGU_TASKS_TRIGGER6_OFFSET)
#define NRF52_EGU5_TASKS_TRIGGER7      (NRF52_EGU5_BASE + NRF52_EGU_TASKS_TRIGGER7_OFFSET)
#define NRF52_EGU5_TASKS_TRIGGER8      (NRF52_EGU5_BASE + NRF52_EGU_TASKS_TRIGGER8_OFFSET)
#define NRF52_EGU5_TASKS_TRIGGER9      (NRF52_EGU5_BASE + NRF52_EGU_TASKS_TRIGGER9_OFFSET)
#define NRF52_EGU5_TASKS_TRIGGER10     (NRF52_EGU5_BASE + NRF52_EGU_TASKS_TRIGGER10_OFFSET)
#define NRF52_EGU5_TASKS_TRIGGER11     (NRF52_EGU5_BASE + NRF52_EGU_TASKS_TRIGGER11_OFFSET)
#define NRF52_EGU5_TASKS_TRIGGER12     (NRF52_EGU5_BASE + NRF52_EGU_TASKS_TRIGGER12_OFFSET)
#define NRF52_EGU5_TASKS_TRIGGER13     (NRF52_EGU5_BASE + NRF52_EGU_TASKS_TRIGGER13_OFFSET)
#define NRF52_EGU5_TASKS_TRIGGER14     (NRF52_EGU5_BASE + NRF52_EGU_TASKS_TRIGGER14_OFFSET)
#define NRF52_EGU5_TASKS_TRIGGER15     (NRF52_EGU5_BASE + NRF52_EGU_TASKS_TRIGGER15_OFFSET)
#define NRF52_EGU5_EVENTS_TRIGGERED0   (NRF52_EGU5_BASE + NRF52_EGU_EVENTS_TRIGGERED0_OFFSET)
#define NRF52_EGU5_EVENTS_TRIGGERED1   (NRF52_EGU5_BASE + NRF52_EGU_EVENTS_TRIGGERED1_OFFSET)
#define NRF52_EGU5_EVENTS_TRIGGERED2   (NRF52_EGU5_BASE + NRF52_EGU_EVENTS_TRIGGERED2_OFFSET)
#define NRF52_EGU5_EVENTS_TRIGGERED3   (NRF52_EGU5_BASE + NRF52_EGU_EVENTS_TRIGGERED3_OFFSET)
#define NRF52_EGU5_EVENTS_TRIGGERED4   (NRF52_EGU5_BASE + NRF52_EGU_EVENTS_TRIGGERED4_OFFSET)
#define NRF52_EGU5_EVENTS_TRIGGERED5   (NRF52_EGU5_BASE + NRF52_EGU_EVENTS_TRIGGERED5_OFFSET)
#define NRF52_EGU5_EVENTS_TRIGGERED6   (NRF52_EGU5_BASE + NRF52_EGU_EVENTS_TRIGGERED6_OFFSET)
#define NRF52_EGU5_EVENTS_TRIGGERED7   (NRF52_EGU5_BASE + NRF52_EGU_EVENTS_TRIGGERED7_OFFSET)
#define NRF52_EGU5_EVENTS_TRIGGERED8   (NRF52_EGU5_BASE + NRF52_EGU_EVENTS_TRIGGERED8_OFFSET)
#define NRF52_EGU5_EVENTS_TRIGGERED9   (NRF52_EGU5_BASE + NRF52_EGU_EVENTS_TRIGGERED9_OFFSET)
#define NRF52_EGU5_EVENTS_TRIGGERED10  (NRF52_EGU5_BASE + NRF52_EGU_EVENTS_TRIGGERED10_OFFSET)
#define NRF52_EGU5_EVENTS_TRIGGERED11  (NRF52_EGU5_BASE + NRF52_EGU_EVENTS_TRIGGERED11_OFFSET)
#define NRF52_EGU5_EVENTS_TRIGGERED12  (NRF52_EGU5_BASE + NRF52_EGU_EVENTS_TRIGGERED12_OFFSET)
#define NRF52_EGU5_EVENTS_TRIGGERED13  (NRF52_EGU5_BASE + NRF52_EGU_EVENTS_TRIGGERED13_OFFSET)
#define NRF52_EGU5_EVENTS_TRIGGERED14  (NRF52_EGU5_BASE + NRF52_EGU_EVENTS_TRIGGERED14_OFFSET)
#define NRF52_EGU5_EVENTS_TRIGGERED15  (NRF52_EGU5_BASE + NRF52_EGU_EVENTS_TRIGGERED15_OFFSET)

/* Register bit definitions *************************************************/

