apache/nuttx/arch/arm/src/nrf52/hardware/nrf52_egu.h
#define NRF52_EGU_INTEN_TRIGGERED0      (1 << 0)   /* Enable */
#define NRF52_EGU_INTEN_TRIGGERED1      (1 << 1)   /* Enable */
#define NRF52_EGU_INTEN_TRIGGERED2      (1 << 2)   /* Enable */
#define NRF52_EGU_INTEN_TRIGGERED3      (1 << 3)   /* Enable */
#define NRF52_EGU_INTEN_TRIGGERED4      (1 << 4)   /* Enable */
#define NRF52_EGU_INTEN_TRIGGERED5      (1 << 5)   /* Enable */
#define NRF52_EGU_INTEN_TRIGGERED6      (1 << 6)   /* Enable */
#define NRF52_EGU_INTEN_TRIGGERED7      (1 << 7)   /* Enable */
#define NRF52_EGU_INTEN_TRIGGERED8      (1 << 8)   /* Enable */
#define NRF52_EGU_INTEN_TRIGGERED9      (1 << 9)   /* Enable */
#define NRF52_EGU_INTEN_TRIGGERED10     (1 << 10)  /* Enable */
#define NRF52_EGU_INTEN_TRIGGERED11     (1 << 11)  /* Enable */
#define NRF52_EGU_INTEN_TRIGGERED12     (1 << 12)  /* Enable */
#define NRF52_EGU_INTEN_TRIGGERED13     (1 << 13)  /* Enable */
#define NRF52_EGU_INTEN_TRIGGERED14     (1 << 14)  /* Enable */
#define NRF52_EGU_INTEN_TRIGGERED15     (1 << 15)  /* Enable */

#define NRF52_EGU_INTENSET_TRIGGERED0   (1 << 0)   /* Read: Enabled */
#define NRF52_EGU_INTENSET_TRIGGERED1   (1 << 1)   /* Read: Enabled */
#define NRF52_EGU_INTENSET_TRIGGERED2   (1 << 2)   /* Read: Enabled */
#define NRF52_EGU_INTENSET_TRIGGERED3   (1 << 3)   /* Read: Enabled */
#define NRF52_EGU_INTENSET_TRIGGERED4   (1 << 4)   /* Read: Enabled */
#define NRF52_EGU_INTENSET_TRIGGERED5   (1 << 5)   /* Read: Enabled */
#define NRF52_EGU_INTENSET_TRIGGERED6   (1 << 6)   /* Read: Enabled */
#define NRF52_EGU_INTENSET_TRIGGERED7   (1 << 7)   /* Read: Enabled */
#define NRF52_EGU_INTENSET_TRIGGERED8   (1 << 8)   /* Read: Enabled */
#define NRF52_EGU_INTENSET_TRIGGERED9   (1 << 9)   /* Read: Enabled */
#define NRF52_EGU_INTENSET_TRIGGERED10  (1 << 10)  /* Read: Enabled */
#define NRF52_EGU_INTENSET_TRIGGERED11  (1 << 11)  /* Read: Enabled */
#define NRF52_EGU_INTENSET_TRIGGERED12  (1 << 12)  /* Read: Enabled */
#define NRF52_EGU_INTENSET_TRIGGERED13  (1 << 13)  /* Read: Enabled */
#define NRF52_EGU_INTENSET_TRIGGERED14  (1 << 14)  /* Read: Enabled */
#define NRF52_EGU_INTENSET_TRIGGERED15  (1 << 15)  /* Read: Enabled */

#define NRF52_EGU_INTENCLR_TRIGGERED0   (1 << 0)   /* Read: Enabled */
#define NRF52_EGU_INTENCLR_TRIGGERED1   (1 << 1)   /* Read: Enabled */
#define NRF52_EGU_INTENCLR_TRIGGERED2   (1 << 2)   /* Read: Enabled */
#define NRF52_EGU_INTENCLR_TRIGGERED3   (1 << 3)   /* Read: Enabled */
#define NRF52_EGU_INTENCLR_TRIGGERED4   (1 << 4)   /* Read: Enabled */
#define NRF52_EGU_INTENCLR_TRIGGERED5   (1 << 5)   /* Read: Enabled */
#define NRF52_EGU_INTENCLR_TRIGGERED6   (1 << 6)   /* Read: Enabled */
#define NRF52_EGU_INTENCLR_TRIGGERED7   (1 << 7)   /* Read: Enabled */
#define NRF52_EGU_INTENCLR_TRIGGERED8   (1 << 8)   /* Read: Enabled */
#define NRF52_EGU_INTENCLR_TRIGGERED9   (1 << 9)   /* Read: Enabled */
#define NRF52_EGU_INTENCLR_TRIGGERED10  (1 << 10)  /* Read: Enabled */
#define NRF52_EGU_INTENCLR_TRIGGERED11  (1 << 11)  /* Read: Enabled */
#define NRF52_EGU_INTENCLR_TRIGGERED12  (1 << 12)  /* Read: Enabled */
#define NRF52_EGU_INTENCLR_TRIGGERED13  (1 << 13)  /* Read: Enabled */
#define NRF52_EGU_INTENCLR_TRIGGERED14  (1 << 14)  /* Read: Enabled */
#define NRF52_EGU_INTENCLR_TRIGGERED15  (1 << 15)  /* Read: Enabled */

/****************************************************************************
 * Public Types
 ****************************************************************************/

/****************************************************************************
 * Public Data
 ****************************************************************************/

#ifdef __cplusplus
#define EXTERN extern "C"
extern "C"
{
#else
#define EXTERN extern
#endif

/****************************************************************************
 * Inline Functions
 ****************************************************************************/

/****************************************************************************
 * Public Function Prototypes
 ****************************************************************************/

#undef EXTERN
#ifdef __cplusplus
}
#endif

#endif // _ARCH_ARM_SRC_NRF52_HARDWARE_NRF52_EGU_H
